Revit 2027 API
AnalyticalMember.CanSplit Method
 Identifies whether a particular analytical member can be split at a point on it's defining curve (by Split(Double) ).
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanSplit()
Public Function CanSplit As Boolean
public:
bool CanSplit()
member CanSplit : unit -> bool
Return Value
Boolean
 True if the analytical member can be split, otherwise false.
See Also
Reference
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace